# Table of Contents
1. Import libraries
2. Import data: customers.csv, ords_prods_merge4.pkl
3. Data Consistency checks: customers.csv -> renaming columns, checking for missing values, duplicates, and mixed-type data
4. Combining datasets: customers and orders_products_merge4
5. Export data: ords_prods_cust_merge.pkl

# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# define path

path = r'/users/stephenhelvig/documents/python projects/instacart basket analysis'

# Import Data

In [3]:
# import customer data

cust = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'))

In [4]:
# import rest of merged data

df = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'ords_prods_merge4.pkl'))

In [5]:
cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
cust.shape

(206209, 10)

In [7]:
df.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,prices,max_order,loyalty_flag,users_avg_product_price,product_price_spending_flag,order_total,avg_spend_per_user,avg_order_spending_flag,median_days_since_prior_order,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,9.0,10,New customer,6.367797,Low spender,31.6,37.57,Low order spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,12.5,10,New customer,6.367797,Low spender,31.6,37.57,Low order spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,4.4,10,New customer,6.367797,Low spender,31.6,37.57,Low order spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,4.7,10,New customer,6.367797,Low spender,31.6,37.57,Low order spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,1.0,10,New customer,6.367797,Low spender,31.6,37.57,Low order spender,20.5,Non-frequent customer

In [8]:
df.shape

(32434489, 23)

# Data Consistency checks: customers.csv

In [9]:
# renaming columns in customer df
cust = cust.rename(columns={
    'First Name' : 'first_name',
    'Surnam' : 'last_name',
    'Gender' : 'gender',
    'STATE' : 'state',
    'Age' : 'age',
    'n_dependants' : 'number_of_dependents',
    'fam_status' : 'family_status'})

In [10]:
# check ouput

cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependents,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
cust.describe()

             user_id            age  number_of_dependents         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [12]:
# check for missing values
missing = cust.isnull().sum()

In [13]:
missing

user_id                     0
first_name              11259
last_name                   0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependents        0
family_status               0
income                      0
dtype: int64

Nothing to be done here. Missing first names won't affect the analysis

In [14]:
# check for duplicates
dups = cust[cust.duplicated()]

In [15]:
dups.sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependents    0
family_status           0
income                  0
dtype: object

No duplicates found

In [16]:
# check data types
cust.dtypes

user_id                  int64
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependents     int64
family_status           object
income                   int64
dtype: object

These all make sense. No mixed types either.

In [17]:
df.dtypes

order_id                           int64
user_id                            int64
order_number                       int64
order_day_of_week                  int64
order_hour_of_day                  int64
days_since_prior_order           float64
first_order                         bool
product_id                         int64
add_to_cart_order                  int64
reordered                          int64
product_name                      object
aisle_id                           int64
department_id                      int64
prices                           float64
max_order                          int64
loyalty_flag                      object
users_avg_product_price          float64
product_price_spending_flag       object
order_total                      float64
avg_spend_per_user               float64
avg_order_spending_flag           object
median_days_since_prior_order    float64
frequency_flag                    object
dtype: object

user_id in both dataframes is int64

# Combining datasets: customers and orders_products_merge4

In [18]:
ords_prods_cust = pd.merge(df, cust, on = 'user_id', how = 'inner')

In [19]:
# checking output
ords_prods_cust.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,frequency_flag,first_name,last_name,gender,state,age,date_joined,number_of_dependents,family_status,income
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [20]:
ords_prods_cust.shape

(32434489, 32)

The number of rows and columns all look good.

# Export Data

In [21]:
ords_prods_cust.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'ords_prods_cust_merge.pkl'))